#screen是什么

<p><strong>作为linux服务器管理员,经常要使用ssh登陆到远程linux机器上做一些耗时的操作。</strong></p>
<p>也许你遇到过使用telnet或SSH远程登录linux,运行一些程序。如果这些程序需要运行很长时间(几个小时)，而程序运行过程中出现网络故障，或者客户机故障，这时候客户机与远程服务器的链接将终端，并且远程服务器没有正常结束的命令将被迫终止。</p>
<p>又比如你SSH到主机上后，开始批量的scp命令，如果这个ssh线程断线了，scp进程就中断了。在远程服务器上正在运行某些耗时的作业，但是工作还没做完快要下班了，退出的话就会中断操作了，如何才好呢？</p>
<p><strong> 我们利用screen命令可以很好的解决这个问题。</strong>实现在断开SSH的情况下,在服务器上继续执行程序。</p>
<p><strong>那什么是screen命令?</strong></p>
<p>Screen被称之为一个全屏窗口管理器，用他可以轻松在一个物理终端上获得多个虚拟终端的效果。</p>
<p><strong>Screen功能说明</strong>：</p>
<p>简单来说，Screen是一个可以在多个进程之间多路复用一个物理终端的窗口管理器,这意味着你能够使用一个单一的终端窗口运行多终端的应用。Screen中有会话的概念，用户可以在一个screen会话中创建多个screen窗口，在每一个screen窗口中就像操作一个真实的telnet/SSH连接窗口那样。</p>
